Public Member Functions | Friends | List of all members
ACAPI::Cutaway::CuttingPlane Class Reference
Cutting Plane Management
CuttingPlane if the representation of the cutting plane settings. More...
#include <CuttingPlane.hpp>
 Inheritance diagram for ACAPI::Cutaway::CuttingPlane:
 Public Member Functions
ACAPI::Result< bool >  | Is3DCutawayEnabled () const
ACAPI::Result< void >  | Set3DCutawayStatus (bool status) const
ACAPI::Result< bool >  | AreCuttingPlanesVisible () const
ACAPI::Result< void >  | SetCuttingPlanesVisibility (bool visible) const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::CuttingPlaneImpl
ACAPI::Result< CuttingPlane >  | GetCuttingPlane ()
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
CuttingPlane if the representation of the cutting plane settings.
Since
Archicad 28
Friends And Related Symbol Documentation
◆ GetCuttingPlane
 ACAPI::Result< CuttingPlane > GetCuttingPlane  |  ( |   | )
friend
Returns
Gets the entity representing the cutting plane.